#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

module.oci.random_password.k3s_token: Refreshing state... [id=none]
module.cloudflare-dns-huna.data.cloudflare_zone.zone: Reading...
module.cloudflare-dns-clusterapps.data.cloudflare_zone.zone: Reading...
module.cloudflare-dns-cluster.data.cloudflare_zone.zone: Reading...
module.oci.data.cloudinit_config.init_vm_primary["k3smaster1"]: Reading...
module.oci.data.cloudinit_config.init_vm_primary["k3smaster1"]: Read complete after 0s [id=3221995801]
module.oci.oci_core_vcn.vcn: Refreshing state... [id=ocid1.vcn.oc1.eu-frankfurt-1.amaaaaaawizbioqahj2z2t5tx4xytm5to65tewlpe6mpatt4mk73qrx7ipsq]
module.cloudflare-dns-huna.data.cloudflare_zone.zone: Read complete after 1s [id=4ac04d4e2be540bc8f1b3fec61b03d8d]
module.cloudflare-dns-cluster.data.cloudflare_zone.zone: Read complete after 1s [id=6723a5a83bf5ef5991798bd4dad71ae5]
module.cloudflare-dns-clusterapps.data.cloudflare_zone.zone: Read complete after 1s [id=6723a5a83bf5ef5991798bd4dad71ae5]
module.oci.oci_core_internet_gateway.internet_gateway: Refreshing state... [id=ocid1.internetgateway.oc1.eu-frankfurt-1.aaaaaaaapgtmk4o7m5v2wbcsafijtwli2nlddsi5ww7keraquho54xg34ohq]
module.oci.oci_core_network_security_group.nsg: Refreshing state... [id=ocid1.networksecuritygroup.oc1.eu-frankfurt-1.aaaaaaaalj7ixfz34hf4uilsd3sgu3h6qc3k23qjyku5dni75yc3o7254fzq]
module.oci.oci_core_default_security_list.security_list: Refreshing state... [id=ocid1.securitylist.oc1.eu-frankfurt-1.aaaaaaaanw24gzgyec4mviyzy5o7p6hjcw3fo7qaj6d57fcrggp34ny77agq]
module.oci.oci_core_network_security_group_security_rule.allow_https_from_all: Refreshing state... [id=AEB74A]
module.oci.oci_core_network_security_group_security_rule.allow_kubeapi_from_all: Refreshing state... [id=3C671F]
module.oci.oci_core_network_security_group_security_rule.allow_http_from_all: Refreshing state... [id=E70F68]
module.oci.oci_core_subnet.k3s_subnet: Refreshing state... [id=ocid1.subnet.oc1.eu-frankfurt-1.aaaaaaaapm2yyqlgx323wjsqf7tdnfmbdu67yhqfji65t277elpfxhdg4qva]
module.oci.oci_core_default_route_table.default_oci_core_default_route_table: Refreshing state... [id=ocid1.routetable.oc1.eu-frankfurt-1.aaaaaaaasf7wc3qjgr2aj4hqgbiaqlxlsxsvasmn4hsi2cvbszojlcnee62q]
module.oci.oci_core_instance.vm_primary["k3smaster1"]: Refreshing state... [id=ocid1.instance.oc1.eu-frankfurt-1.antheljrwizbioqcwinc22gh5p6s54gregujfw5qshqp6ktemldzsuwisfra]
module.cloudflare-dns-cluster.cloudflare_record.record["0"]: Refreshing state... [id=e4f3dd2e71bf190a5c435816d6354401]
module.ssh-extract-kubeconfig.time_sleep.wait_60_seconds: Refreshing state... [id=2023-07-07T22:36:16Z]
module.cloudflare-dns-clusterapps.cloudflare_record.record["0"]: Refreshing state... [id=91d30e8d07df797d697e37cd411a3be0]
module.cloudflare-dns-huna.cloudflare_record.record["0"]: Refreshing state... [id=139032a1621d5cce115dbed523e51cf8]
module.cloudflare-dns-huna.cloudflare_record.record["1"]: Refreshing state... [id=105ab125e015ffcded5dda92fe0f5a6b]
module.ssh-extract-kubeconfig.ssh_sensitive_resource.cat: Refreshing state... [id=34113904410968819]
module.kubeconfig-github-secret.github_actions_organization_secret.kubeconfig_secret: Refreshing state... [id=DEV_KUBECONFIG]
module.cluster-config.helm_release.prometheus-basic-auth-secret[0]: Refreshing state... [id=prometheus-basic-auth-secret]
module.cluster-config.helm_release.telepresence[0]: Refreshing state... [id=traffic-manager]
module.cluster-config.helm_release.prometheus[0]: Refreshing state... [id=prometheus]
module.cluster-config.helm_release.jaeger-basic-auth-secret[0]: Refreshing state... [id=jaeger-basic-auth-secret]
module.cluster-config.helm_release.jaeger[0]: Refreshing state... [id=jaeger]
module.cluster-config.tls_private_key.trustanchor_key[0]: Refreshing state... [id=9d4014a39ad6bce9a32353e3afe88633b280fef9]
module.cluster-config.tls_private_key.issuer_key[0]: Refreshing state... [id=d0126637e6624df8798bd7d23af9a3b32cfffa4b]
module.cluster-config.helm_release.linkerd-crds[0]: Refreshing state... [id=linkerd-crds]
module.cluster-config.helm_release.newrelic[0]: Refreshing state... [id=newrelic]
module.cluster-config.tls_self_signed_cert.trustanchor_cert[0]: Refreshing state... [id=31413412826754446745399292072854562132]
module.cluster-config.tls_cert_request.issuer_req[0]: Refreshing state... [id=bcb23603369a40c9a4b29dc29656f3eef2b250fc]
module.cluster-config.tls_locally_signed_cert.issuer_cert[0]: Refreshing state... [id=224819890951771595569881240564569304670]
module.cluster-config.helm_release.linkerd-control-plane[0]: Refreshing state... [id=linkerd-control-plane]
module.cluster-config.helm_release.ingress-nginx[0]: Refreshing state... [id=ingress-nginx]
module.cluster-config.helm_release.linkerd-basic-auth-secret[0]: Refreshing state... [id=linkerd-basic-auth-secret]
module.cluster-config.helm_release.kubernetes-dashboard-basic-auth-secret[0]: Refreshing state... [id=kubernetes-dashboard-basic-auth-secret]
module.cluster-config.helm_release.kubernetes-dashboard[0]: Refreshing state... [id=kubernetes-dashboard]
module.cluster-config.helm_release.cert-manager[0]: Refreshing state... [id=cert-manager]
module.cluster-config.helm_release.linkerd-viz[0]: Refreshing state... [id=linkerd-viz]
module.cluster-config.kubernetes_cluster_role_binding.kubernetes-dashboard-cluster-admin-role-binding[0]: Refreshing state... [id=kubernetes-dashboard-cluster-admin-role-binding]
module.cluster-config.kubernetes_ingress_v1.linkerd-viz-ingress[0]: Refreshing state... [id=linkerd-viz/linkerd-viz]
module.cluster-config.helm_release.linkerd-jaeger[0]: Refreshing state... [id=linkerd-jaeger]
module.cluster-config.helm_release.letsencrypt-cluster-issuer[0]: Refreshing state... [id=cert-manager-issuers]
module.cluster-config.helm_release.gatekeeper[0]: Refreshing state... [id=gatekeeper]
module.cluster-config.helm_release.root-ca[0]: Refreshing state... [id=root-ca]
module.cluster-config.helm_release.root-ca-cert-manager-issuers[0]: Refreshing state... [id=root-ca-cert-manager-issuers]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cluster-config.helm_release.trivy-operator[0] will be created
  + resource "helm_release" "trivy-operator" {
      + atomic                     = false
      + chart                      = "trivy-operator"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "trivy-operator"
      + namespace                  = "trivy-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://aquasecurity.github.io/helm-charts/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 1500
      + values                     = [
          + (sensitive value),
        ]
      + verify                     = false
      + version                    = "0.18.3"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: @alinflorin, Action: `pull_request`, Working Directory: `dev`, Workflow: `Terraform DEV`*